"""This list comes from the Perseus Hopper source
[http://sourceforge.net/projects/perseus-hopper], found at
"/sgml/reading/build/stoplists", though this only contained acute accents on
the ultima. There has been added to this grave accents to the ultima of each.
Perseus source is made available under the Mozilla Public License 1.1
(MPL 1.1) [http://www.mozilla.org/MPL/1.1/].
"""

__author__ = ['Kyle P. Johnson <kyle@kyle-p-johnson.com>']
__license__ = 'GPL License.'
#Vatri: added support for tonos vs oxia acute accent

STOPS_LIST = ['αὐτὸς',
				'αὐτός',
				'γε',
				'γὰρ',
				'γάρ',
				"δ'",
				'δαὶ',
				'δαὶς',
				'δαί',
				'δαίς',
				'διὰ',
				'διά',
				'δὲ',
				'δέ',
				'δὴ',
				'δή',
				'εἰ',
				'εἰμὶ',
				'εἰμί',
				'εἰς',
				'εἴμι',
				'κατὰ',
				'κατά',
				'καὶ',
				'καί',
				'μετὰ',
				'μετά',
				'μὲν',
				'μέν',
				'μὴ',
				'μή',
				'οἱ',
				'οὐ',
				'οὐδεὶς',
				'οὐδείς',
				'οὐδὲ',
				'οὐδέ',
				'οὐκ',
				'οὔτε',
				'οὕτως',
				'οὖν',
				'οὗτος',
				'παρὰ',
				'παρά',
				'περὶ',
				'περί',
				'πρὸς',
				'πρός',
				'σὸς',
				'σός',
				'σὺ',
				'σὺν',
				'σύ',
				'σύν',
				'τε',
				'τι',
				'τις',
				'τοιοῦτος',
				'τοὶ',
				'τοί',
				'τοὺς',
				'τούς',
				'τοῦ',
				'τὰ',
				'τά',
				'τὴν',
				'τήν',
				'τὶ',
				'τὶς',
				'τί',
				'τίς',
				'τὸ',
				'τὸν',
				'τό',
				'τόν',
				'τῆς',
				'τῇ',
				'τῶν',
				'τῷ',
				"ἀλλ'",
				'ἀλλὰ',
				'ἀλλά',
				'ἀπὸ',
				'ἀπό',
				'ἂν',
				'ἄλλος',
				'ἄν',
				'ἄρα',
				'ἐγὼ',
				'ἐγώ',
				'ἐκ',
				'ἐξ',
				'ἐμὸς',
				'ἐμός',
				'ἐν',
				'ἐπὶ',
				'ἐπί',
				'ἐὰν',
				'ἐάν',
				'ἑαυτοῦ',
				'ἔτι',
				'ἡ',
				'ἢ',
				'ἤ',
				'ὁ',
				'ὃδε',
				'ὃς',
				'ὅδε',
				'ὅς',
				'ὅστις',
				'ὅτι',
				'ὑμὸς',
				'ὑμός',
				'ὑπὲρ',
				'ὑπέρ',
				'ὑπὸ',
				'ὑπό',
				'ὡς',
				'ὥστε',
				'ὦ',
				'ξύν',
				'ξὺν',
				'σύν',
				'σὺν',
				'τοῖς',
				'τᾶς',
				'αὐτός',
				'γάρ',
				'δαί',
				'δαίς',
				'διά',
				'δέ',
				'δή',
				'εἰμί',
				'κατά',
				'καί',
				'μετά',
				'μέν',
				'μή',
				'οὐδείς',
				'οὐδέ',
				'παρά',
				'περί',
				'πρός',
				'σός',
				'σύ',
				'σύν',
				'τοί',
				'τούς',
				'τά',
				'τήν',
				'τί',
				'τίς',
				'τό',
				'τόν',
				'ἀλλά',
				'ἀπό',
				'ἐγώ',
				'ἐμός',
				'ἐπί',
				'ἐάν',
				'ὑμός',
				'ὑπέρ',
				'ὑπό',]
				
STOPS_LIST_ID = [
'95612', #σοῦ
'nlsj44570', #ἐλελελεῦ
'82862', #πη
'26488', #διέκ
'2305', #αἴθε
'20917', #βρεκεκεκέξ
'79904', #πᾶς
'49772', #ἰαυοῖ
'nlsj27804', #αἴ
'72613', #οἱονεί
'nlsj13263', #ἆρα
'nlsj77899', #ὁπωσοῦν
'29859', #ἐάν
'nlsj31917', #δᾶ
'nlsj67612', #κοί
'nlsj95374', #πύπαξ
'4430', #ἀλλήλων
'40630', #ἐπιπρό
'nlsj60594', #ἰατταταί
'38469', #ἐπειδάν
'50615', #ἰού
'75687', #ὅταν
'75736', #οὐαί
'18953', #βαβαί
'12243', #ἀπό
'116421', #ὥστε
'31598', #ἕκαστος
'nlsj130', #μαράν
'75512', #ὅς
'71882', #ὁ
'9778', #ἀντί
'nlsj10602', #Τῆνος
'17266', #ἀτταταῖ
'46965', #ἠμέν
'86405', #πρό
'91546', #πύππαξ
'nlsj60215', #ἱππαπαί
'8535', #ἄνευθε
'104169', #τοιοῦτος
'29856', #ἕ
'112447', #φῦ
'106745', #ὑμός
'43379', #εὐάν
'66572', #μετά
'79686', #πάροιθε
'116404', #ὡσάν
'34409', #ἔμπλην
'24493', #δήπου
'nlsj84271', #πέρ
'nlsj53397', #εἷος
'67281', #μέχρι
'nlsj28922', #βαβαῖ
'79791', #πάρος
'16958', #ἀτάρ
'30817', #εἰ
'31479', #εἰσότε
'nlsj11324', #ἆ
'nlsj29848', #βοῖ
'49767', #ἰατταταῖ
'75708', #ὀτοτοῖ
'102752', #τε
'nlsj38924', #ἐξ
'31130', #εἰμί
'46568', #ἠέ
'2115', #αἰβοῖ
'75520', #ὅσγε
'75890', #οὕνεκα
'nlsj78207', #ὀά
'nlsj98267', #σαυτοῦ
'3843', #ἀλαλαί
'38492', #ἐπείπερ
'37223', #ἐξέτι
'11443', #ἀπαπαῖ
'nlsj42892', #ἐή
'nlsj72443', #μέντοι
'72174', #ὁθούνεκα
'21705', #γε
'85709', #πόπαξ
'nlsj126', #ἐπί
'8529', #ἄνευ
'47387', #ἤν
'nlsj76626', #νή
'34194', #ἐμός
'75730', #οὐ
'67878', #μιν
'nlsj13183', #ἄττης
'94440', #σίττα
'116208', #ὤμοι
'nlsj69435', #πω
'24491', #δήποθεν
'46045', #ἕωσπερ
'67283', #μή
'4357', #ἀλλά
'22708', #γοῦν
'6213', #ἀνά
'97456', #σύ
'104401', #τοροτίξ
'31235', #εἰς
'83818', #πλήν
'nlsj65910', #τίς
'14639', #ἄρα
'101628', #σφεῖς
'53647', #κατά
'67299', #μηδέ
'6207', #ἄν
'79997', #πατάξ
'116401', #ὡς
'104155', #τοι
'34700', #ἐν
'46642', #ἠδέ
'64387', #μά
'75688', #ὅτε
'24494', #δήπουθεν
'nlsj13266', #ἀᾶ
'54655', #καταντικρύ
'unknown', #unknown
'70864', #νιν
'116069', #ὠή
'88252', #προπάροιθε
'nlsj39495', #ἐγώγε
'49096', #θρεττανελό
'75765', #οὐδείς
'46640', #ἤγουν
'75764', #οὐδέ
'22880', #γρῦ
'30903', #εἴθε
'74713', #ὅπως
'77726', #παπαῖ
'85712', #πόποι
'107039', #ὑπείρ
'72432', #οἴμοι
'99002', #σύν
'45273', #εὖτε
'2105', #αἰαῖ
'27112', #διό
'107560', #ὕπερθεν
'51548', #ἰωά
'31575', #ἐκ
'nlsj75419', #μύ
'88443', #πρός
'nlsj81710', #παπαί
'nlsj97861', #ῥυππαπαί
'76063', #οὕτως
'nlsj49033', #ἐπήν
'nlsj80297', #οἰοιοῖ
'103628', #τέττα
'49770', #ἰαῦ
'21618', #γάρ
'5704', #ἀμφί
'nlsj15631', #ἀλαλαλαί
'50492', #ἵνα
'46569', #ἤ
'107052', #ὑπέκ
'6208', #ἄν
'104051', #τις
'52022', #καίπερ
'75698', #ὁτιή
'112981', #χαλβάνη
'nlsj66618', #πῆ
'95610', #σός
'76059', #οὔτις
'67461', #μήν
'17245', #ἄττα
'5235', #ἀμήν
'23596', #δέ
'104431', #τοτοβρίξ
'75598', #ὅστις
'76050', #οὔτε
'47640', #ἤτε
'42974', #ἔστε
'91979', #πώμαλα
'29855', #ἒ
'110604', #φεῦ
'24295', #δή
'30818', #εἶα
'75588', #ὅστε
'38027', #ἐπάν
'nlsj67577', #κοάξ
'105096', #τριοτό
'23196', #δαί
'nlsj67563', #ποτέ
'38466', #ἐπεί
'67553', #μήτοι
'47642', #ἤτοι
'108092', #ὑπό
'nlsj67509', #ποθεν
'71886', #ὀᾶ
'nlsj59718', #ἦτε
'46043', #ἕως
'33935', #ἐμαυτοῦ
'27225', #διόπερ
'81017', #περί
'116275', #ὠόπ
'18080', #αὖ
'31159', #εἴπερ
'49658', #ἰαιβοῖ
'nlsj81714', #παππαπαππαπαῖ
'71076', #νόσφι
'29857', #ἔα
'77763', #παρά
'nlsj111984', #ὒ
'31951', #ἐκεῖνος
'58517', #κόκκυ
'67302', #μηδείς
'76168', #ὄφρα
'66260', #μέν
'76062', #οὗτος
'50151', #ἰεῦ
'24517', #διά
'77496', #πανοίμοι
'92998', #σαβοῖ
'47500', #ἦπου
'22596', #γοῖ
'81749', #πέριξ
'43266', #ἔτι
'nlsj69523', #πως
'30738', #ἕε
'nlsj77248', #ὅμως
'67541', #μήτε
'nlsj59697', #ἤπου
'14382', #ἀππαπαῖ
'nlsj61636', #καίτοι
'33573', #ἐλελεῦ
'77727', #παπαιάξ
'nlsj106623', #τιοτίγξ
'nlsj106622', #τιό
'nlsj95530', #πυππάξ
'49814', #ἰδέ
'nlsj79940', #οἰ
'nlsj80499', #οὐμενοῦν
'79409', #παρέξ
'44596', #εὐοῖ
'107183', #ὑπέρ
'46050', #ζά
'nlsj53463', #εἶεν
'116027', #ὦ
'75887', #οὖν
'75733', #οὐά
'25645', #διαπρό
'72010', #ὅδε
'104159', #τοιγάρ
'35364', #ἕνεκα
'nlsj61279', #κἀν
'35435', #ἔνερθε
'88225', #πρόπαρ
'50670', #ἱππαπαῖ
'30657', #ἐγώ
'17907', #αὐτός
'nlsj59892', #ἠύτε
'nlsj61187', #ἰώ
'104163', #τοίνυν
'57377', #κικκαβαῦ
'24492', #δήποτε
'116405', #ὡσανεί
'4490', #ἄλλος
'nlsj8361', #Οὖτις
'29881', #ἑαυτοῦ
'51951', #καί
'56400', #κεῖνος
'50318', #ἴκτις
'53040', #κάν
'17016', #ἄτερ
'27319', #διότι
'50159', #ἰή
'nlsj96582', #θήν
'103865', #τῆνος
'104432', #τοτοῖ
'nlsj59157' #ᾗπερ
]				